In [2]:
# Importing Libraries 
import pandas as pd
from datasets import load_dataset 
import matplotlib.pyplot as plt
# Loading Data
dataset = load_dataset ( 'lukebarousse/data_jobs')
df = dataset ['train'].to_pandas ()
# Data Cleanup
df['job_posted_date'] = pd.to_datetime (df ['job_posted_date'])

In [3]:
median_salary = df['salary_year_avg'].median()
median_hourly = df['salary_hour_avg'].median()

In [ ]:
df_filled = df
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_hourly)

In [18]:
df_filled.loc[:10, 'salary_year_avg': 'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

In [19]:
df_unique = df_filled.drop_duplicates()

In [26]:
print(len(df_filled))
print(len(df_unique))
print(len(df_filled)-len(df_unique))

785741
785640
101

In [27]:
df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])

In [28]:
print(len(df_filled))
print(len(df_unique))
print(len(df_filled)-len(df_unique))

785741
508042
277699